
## Plan Result (aat)




<pre><code>Plan: 4 to add, 2 to change, 0 to destroy.</code></pre>

* Create
  * module.wa_workflow_api_database_flex.azurerm_monitor_action_group.db-alerts-action-group[0]
  * module.wa_workflow_api_database_flex.azurerm_monitor_metric_alert.db_alert_cpu[0]
  * module.wa_workflow_api_database_flex.azurerm_monitor_metric_alert.db_alert_memory[0]
  * module.wa_workflow_api_database_flex.azurerm_monitor_metric_alert.db_alert_storage_utilization[0]
* Update
  * module.wa_workflow_api_database_flex.azurerm_postgresql_flexible_server.pgsql_server
  * module.wa_workflow_api_database_flex.azurerm_resource_group.rg[0]


<details><summary>Change Result (Click me)</summary>

```hcl

  # module.wa_workflow_api_database_flex.azurerm_monitor_action_group.db-alerts-action-group[0] will be created
  + resource "azurerm_monitor_action_group" "db-alerts-action-group" {
      + enabled             = true
      + id                  = (known after apply)
      + location            = "global"
      + name                = "wa-workflow-api-postgres-db-flex-wa-support"
      + resource_group_name = "wa-workflow-api-postgres-db-flex-data-aat"
      + short_name          = "wa-workflow-"
      + tags                = (known after apply)

      + email_receiver {
          + email_address           = (sensitive value)
          + name                    = "Email Receiver"
          + use_common_alert_schema = true
        }
    }

  # module.wa_workflow_api_database_flex.azurerm_monitor_metric_alert.db_alert_cpu[0] will be created
  + resource "azurerm_monitor_metric_alert" "db_alert_cpu" {
      + auto_mitigate            = true
      + description              = "Whenever the cpu utilization is greater than 80"
      + enabled                  = true
      + frequency                = "PT1H"
      + id                       = (known after apply)
      + name                     = "db_cpu_percent_wa-workflow-api-postgres-db-flex-aat"
      + resource_group_name      = "wa-workflow-api-postgres-db-flex-data-aat"
      + scopes                   = [
          + "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/wa-workflow-api-postgres-db-flex-data-aat/providers/Microsoft.DBforPostgreSQL/flexibleServers/wa-workflow-api-postgres-db-flex-aat",
        ]
      + severity                 = 1
      + tags                     = (known after apply)
      + target_resource_location = (known after apply)
      + target_resource_type     = (known after apply)
      + window_size              = "P1D"

      + action {
          + action_group_id = (known after apply)
        }

      + criteria {
          + aggregation            = "Average"
          + metric_name            = "cpu_percent"
          + metric_namespace       = "Microsoft.DBforPostgreSQL/flexibleServers"
          + operator               = "GreaterThan"
          + skip_metric_validation = false
          + threshold              = 80
        }
    }

  # module.wa_workflow_api_database_flex.azurerm_monitor_metric_alert.db_alert_memory[0] will be created
  + resource "azurerm_monitor_metric_alert" "db_alert_memory" {
      + auto_mitigate            = true
      + description              = "Whenever the memory utilization is greater than 80"
      + enabled                  = true
      + frequency                = "PT1H"
      + id                       = (known after apply)
      + name                     = "db_memory_percent_wa-workflow-api-postgres-db-flex-aat"
      + resource_group_name      = "wa-workflow-api-postgres-db-flex-data-aat"
      + scopes                   = [
          + "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/wa-workflow-api-postgres-db-flex-data-aat/providers/Microsoft.DBforPostgreSQL/flexibleServers/wa-workflow-api-postgres-db-flex-aat",
        ]
      + severity                 = 1
      + tags                     = (known after apply)
      + target_resource_location = (known after apply)
      + target_resource_type     = (known after apply)
      + window_size              = "P1D"

      + action {
          + action_group_id = (known after apply)
        }

      + criteria {
          + aggregation            = "Average"
          + metric_name            = "memory_percent"
          + metric_namespace       = "Microsoft.DBforPostgreSQL/flexibleServers"
          + operator               = "GreaterThan"
          + skip_metric_validation = false
          + threshold              = 80
        }
    }

  # module.wa_workflow_api_database_flex.azurerm_monitor_metric_alert.db_alert_storage_utilization[0] will be created
  + resource "azurerm_monitor_metric_alert" "db_alert_storage_utilization" {
      + auto_mitigate            = true
      + description              = "Whenever the storage utilization is greater than 80"
      + enabled                  = true
      + frequency                = "PT1H"
      + id                       = (known after apply)
      + name                     = "db_storage_utilization_wa-workflow-api-postgres-db-flex-aat"
      + resource_group_name      = "wa-workflow-api-postgres-db-flex-data-aat"
      + scopes                   = [
          + "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/wa-workflow-api-postgres-db-flex-data-aat/providers/Microsoft.DBforPostgreSQL/flexibleServers/wa-workflow-api-postgres-db-flex-aat",
        ]
      + severity                 = 1
      + tags                     = (known after apply)
      + target_resource_location = (known after apply)
      + target_resource_type     = (known after apply)
      + window_size              = "P1D"

      + action {
          + action_group_id = (known after apply)
        }

      + criteria {
          + aggregation            = "Average"
          + metric_name            = "storage_percent"
          + metric_namespace       = "Microsoft.DBforPostgreSQL/flexibleServers"
          + operator               = "GreaterThan"
          + skip_metric_validation = false
          + threshold              = 80
        }
    }

  # module.wa_workflow_api_database_flex.azurerm_postgresql_flexible_server.pgsql_server will be updated in-place
  ~ resource "azurerm_postgresql_flexible_server" "pgsql_server" {
        id                            = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/wa-workflow-api-postgres-db-flex-data-aat/providers/Microsoft.DBforPostgreSQL/flexibleServers/wa-workflow-api-postgres-db-flex-aat"
        name                          = "wa-workflow-api-postgres-db-flex-aat"
      ~ tags                          = {
          - "application"         = "task-management"
          - "autoShutdown"        = "true"
          - "builtFrom"           = "https://github.com/HMCTS/wa-workflow-api.git"
          - "businessArea"        = "CFT"
          - "contactSlackChannel" = "#wa-tech"
          - "environment"         = "staging"
          - "lastUpdated"         = "2024-12-03T09:07:00Z"
          - "managedBy"           = "Work Allocation"
        } -> (known after apply)
        # (18 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.wa_workflow_api_database_flex.azurerm_resource_group.rg[0] will be updated in-place
  ~ resource "azurerm_resource_group" "rg" {
        id         = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/wa-workflow-api-postgres-db-flex-data-aat"
        name       = "wa-workflow-api-postgres-db-flex-data-aat"
      ~ tags       = {
          - "application"         = "task-management"
          - "autoShutdown"        = "true"
          - "builtFrom"           = "https://github.com/HMCTS/wa-workflow-api.git"
          - "businessArea"        = "CFT"
          - "contactSlackChannel" = "#wa-tech"
          - "environment"         = "staging"
          - "lastUpdated"         = "2024-12-03T09:07:00Z"
          - "managedBy"           = "Work Allocation"
        } -> (known after apply)
        # (2 unchanged attributes hidden)
    }

Plan: 4 to add, 2 to change, 0 to destroy.
```

</details>




<!-- github-comment: {"Command":"plan","PRNumber":835,"Program":"tfcmt","SHA1":"","Target":"aat","Vars":{}} -->